/**HTML文档
 * 
 * HTML文档是一个纯文本文件，包含了页面的解构以及由CSS定义的样式，或者可以操作样式的JavaScript代码。
 */

 /**HTML节点 
  * HTML节点是嵌套在另一个元素内的元素或一串字符。除了文本节点外，所有元素都是节点。
 */

 /**
  * HTML元素
  * HTML元素由一个开始标签和一个结束标签组成。
  */

  /**
   * HTML标签
   * HTML标签用来标记元素的开始和结束。标签本身用尖括号来声明。
   * 开始标记的名字会同时被当作元素的名字，同时标签还会包含用来修饰元素的属性。
   */

   /**
    * 属性
    * 属性用来给HTML元素添加额外的信息。这些属性设置在开始标记中。可以使用形如key="value"的键值
    * 对设置它们，或者只设置键。
    * 
    * 我们看看<a>超链接标签，它可以创建从一个页面到另一个页面的链接:很多标签和超链接
    * 标签一样，会有很多特殊的属性，这些属性就好比标签的参数。例如:超链接标签的href属性会
    * 激活该标签的行为，同时在大多数浏览器中会将开始和结束标记中间的文本装换为默认的蓝色。
    */

    <a href="http://google.com">Click me to go to Google</a>

    /**
     * <a>标签
     */